josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-no-bootclick.ino
        int dots = 0;
        for (unsigned int i = 0; i < scanned.length(); i++) {
          if (scanned[i] == '.') dots++;
        }

        // ── VOLCADO COMPLETO del texto escaneado ─────────────────
        Serial.println("\n══════════════════════════════════════════");
        Serial.printf("[QR-SCAN] len=%d  dots=%d\n", scanned.length(), dots);
        Serial.printf("[QR-SCAN] TEXTO: %s\n", scanned.c_str());

        // Hex dump: primeros 60 bytes (3 filas de 20) para detectar
        // caracteres invisibles (BOM, STX, ETX, NUL, etc.)
        Serial.print("[QR-SCAN] HEX:   ");
        int dumpLen = scanned.length() < 60 ? scanned.length() : 60;
        for (int i = 0; i < dumpLen; i++) {
          Serial.printf("%02X ", (uint8_t)scanned[i]);
          if ((i + 1) % 20 == 0 && i + 1 < dumpLen)
            Serial.print("\n                 ");
        }
        if (scanned.length() > 60) {
          Serial.print("... (truncado, total ");
          Serial.print(scanned.length());
          Serial.print(" bytes)");
        }
        Serial.println();

        // Últimos 20 bytes (útil si el scanner añade sufijo)
        if (scanned.length() > 60) {
          Serial.print("[QR-SCAN] HEX tail: ");
          int tailStart = scanned.length() - 20;
          for (int i = tailStart; i < scanned.length(); i++) {
            Serial.printf("%02X ", (uint8_t)scanned[i]);
          }
          Serial.println();
        }
        Serial.println("══════════════════════════════════════════");

        // ── Validación de formato ────────────────────────────────
        // Requisitos: exactamente 2 puntos (token JWT-like) y >= 100 chars
        if (dots != 2 || scanned.length() < 100) {
          Serial.printf("[QR] RECHAZADO — dots=%d (necesita 2), len=%d (necesita >=100)\n",
                        dots, scanned.length());
          if (scanned.length() < 100)
            Serial.println("[QR]   → posible lectura parcial o token truncado");
          if (dots > 2)
            Serial.println("[QR]   → scanner añade puntos extra (prefijo/sufijo?)");
          if (dots < 2)
            Serial.println("[QR]   → faltan puntos — token malformado o scanner omite '.'");
          // Sin relayClick(): el feedback acústico pulsaba el relé (y con la
          // cerradura conectada disparaba el solenoide) en cada lectura
          // rechazada. En producto el relé solo se acciona por apertura real.
          scanned = "";
          return;
        }

        // ── Formato OK → encolar para POST a la API ──────────────
        Serial.println("[QR] Formato OK → encolando para validación API");
        pendingQr  = scanned;
        hasPending = true;
        scanned    = "";
      }
      return;
    }
    // Acumular solo caracteres imprimibles (excluir DEL 0x7F)
    if (event.ascii >= 0x20 && event.ascii != 0x7F) scanned += (char)event.ascii;
  });

  if (!usb.begin()) {
    Serial.printf("usb.begin() fallo: %s\n", usb.lastErrorName());
  } else {
    Serial.println("[USB] Host iniciado correctamente");
  }

  // ── Sincronizar reloj antes de cualquier HTTPS (crítico para TLS) ──
  if (ensureWiFi()) {
    syncSystemTime();
  }

  // ── Health check + blink (solo en WiFi NUEVA) ──────────────────────
  if (ensureWiFi()) {
    HTTPClient h;
    beginApiRequest(h, String(API_BASE_URL) + "/api/v1/health");
    h.setTimeout(4000);
    int c = h.GET();
    String healthResp = h.getString();
    h.end();
    Serial.printf("[BOOT] API health: HTTP %d — %s\n", c, healthResp.c_str());

    // Solo parpadea el switch si la red WiFi es NUEVA (no reconexión a red conocida)
    Preferences prefs;
    prefs.begin("cerraduras", false);
    String currentSsid = WiFi.SSID();
    String lastSsid    = prefs.getString("last_ssid", "");
    prefs.end();

    if (currentSsid.length() > 0 && currentSsid != lastSsid) {
      Serial.printf("[BOOT] WiFi NUEVA: '%s' (anterior: '%s') → parpadeo\n",
                    currentSsid.c_str(),
                    lastSsid.length() ? lastSsid.c_str() : "ninguna");

      String blinkBody;
      blinkBody.reserve(120);  // Fase 1: pre-allocate
      blinkBody = "{\"external_id\":\"" + chipId() + "\"}";
      HTTPClient h2;
      beginApiRequest(h2, String(API_BASE_URL) + "/dashboard-api/blink-light");
      h2.addHeader("Content-Type", "application/json");
      addDeviceAuth(h2);
      h2.setTimeout(15000);
      int bc = h2.POST(blinkBody);
      String blinkResp = h2.getString();
      h2.end();
      Serial.printf("[BOOT] Blink light: HTTP %d — %s\n", bc, blinkResp.c_str());

      // Guardar nuevo SSID tras parpadeo para no repetir en próximos arranques
      prefs.begin("cerraduras", false);
      prefs.putString("last_ssid", currentSsid);
      prefs.end();
    } else {
      Serial.printf("[BOOT] WiFi conocida '%s' — sin parpadeo\n", currentSsid.c_str());
    }
  }
}

// ── loop ──────────────────────────────────────────────────────────────────
void loop() {
  // Fase 1: Watchdog — suscribir loopTask al TWDT recién en la 1ª iteración.
  // setup() corrió con TWDT global init a 60s pero sin loopTask suscrito, de modo
  // que el provisioning largo jamás quedó vigilado con timeout corto.
  static bool wdt_ready = false;
  if (!wdt_ready) {
    esp_task_wdt_add(NULL);
    wdt_ready = true;
  }
  esp_task_wdt_reset();  // Fase 1: feed the watchdog cada iteración

  // Procesar QR pendiente
  if (hasPending) {
    if (!ensureWiFi()) {
      static unsigned long lastWifiWarn = 0;
      if (millis() - lastWifiWarn > 5000) {
        Serial.println("[QR] Pendiente pero sin WiFi — esperando reconexión...");
        lastWifiWarn = millis();
      }
      hasPending = true;  // Fase 1: reencolar para siguiente iteración (no bloqueante)
      return;
    }

    hasPending = false;
    String qr = pendingQr;
    String id = chipId();

    Serial.printf("\n══════════════════════════════════════════\n");
    Serial.printf("[QR-POST] device_id=%s\n", id.c_str());
    Serial.printf("[QR-POST] QR len=%d\n", qr.length());
    Serial.printf("[QR-POST] WiFi RSSI=%d dBm\n", WiFi.RSSI());

