josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-no-bootclick.ino
    // ── Escape manual del QR text para JSON (solo " y \ son peligrosos) ──
    // Base64url no contiene " ni \, pero si el scanner introduce basura
    // por error de lectura, esto evita JSON inválido.
    String qrEscaped = qr;
    qrEscaped.replace("\\", "\\\\");
    qrEscaped.replace("\"", "\\\"");

    String body;
    body.reserve(600);  // Fase 1: pre-allocate for qr_text (~400 chars) + device_id + JSON
    body = "{\"qr_text\":\"" + qrEscaped + "\",\"device_id\":\"" + id + "\"}";

    Serial.printf("[QR-POST] Body JSON (%d bytes): %s\n", body.length(), body.c_str());
    Serial.printf("══════════════════════════════════════════\n");
    esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
    HTTPClient http;
    beginApiRequest(http, String(API_BASE_URL) + "/api/v1/qr/validate");
    http.addHeader("Content-Type", "application/json");
    addDeviceAuth(http);
    http.setTimeout(4000);

    unsigned long qrStart = millis();
    int code = http.POST(body);
    unsigned long qrElapsed = millis() - qrStart;
    String resp = http.getString();
    http.end();
    esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
    yield();

    Serial.printf("[QR] Validación HTTP %d (%lu ms) → %s\n", code, qrElapsed, resp.c_str());

    if (code == 200) {
      Serial.println(">> ACCESO PERMITIDO — Abriendo relé...");
      relayPulse();

      if (ensureWiFi()) {
        esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
        HTTPClient hLock;
        beginApiRequest(hLock, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
        hLock.addHeader("Content-Type", "application/json");
        addDeviceAuth(hLock);
        hLock.setTimeout(3000);
        int lc = hLock.POST("{\"external_id\":\"" + id + "\",\"sub_kind\":\"LOCK\"}");
        String lr = hLock.getString();
        hLock.end();
        esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
        yield();
        Serial.printf("[QR] LOCK heartbeat → HTTP %d %s\n", lc, lr.c_str());
      }
    } else {
      Serial.println(">> ACCESO DENEGADO");
    }
  }

  // Heartbeat cada 30s + F33 command-check
  unsigned long now = millis();
  if (now - lastBeat > 30000) {
    lastBeat = now;

    // ── Fase 1: Heap monitor ──
    unsigned long heap = ESP.getFreeHeap();
    Serial.printf("[HB] Free heap: %lu bytes\n", heap);
    if (heap < 20480) {
      Serial.printf("[HB] ⚠️ ADVERTENCIA: heap bajo (%lu bytes) — posible fuga de memoria\n", heap);
    }

    if (ensureWiFi()) {
      esp_task_wdt_reset();  // defensa: feed antes de cadena HTTP bloqueante
      HTTPClient h;
      beginApiRequest(h, String(API_BASE_URL) + "/api/v1/health");
      h.setTimeout(4000);
      int hc = h.GET();
      String hr = h.getString();
      h.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Health check: HTTP %d — %s\n", hc, hr.c_str());

      // F33: send heartbeat with batch sub_kinds for all ESP32 sub-devices
      String hbBody;
      hbBody.reserve(250);  // Fase 1: pre-allocate
      hbBody = "{\"external_id\":\"" + chipId() + "\",\"sub_kinds\":[\"RPI\",\"SCANNER\",\"LOCK\"]}";
      HTTPClient hb;
      beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hb.addHeader("Content-Type", "application/json");
      addDeviceAuth(hb);
      hb.setTimeout(3000);
      int hbCode = hb.POST(hbBody);
      String hbResp = hb.getString();
      hb.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Heartbeat [HTTP %d] %s\n", hbCode, hbResp.c_str());

      // F33: If API reports pending commands, poll and execute them
      if (hbCode == 200 && hbResp.indexOf("\"has_pending_commands\":true") > 0) {
        Serial.println("[F33] Polling pending commands...");
        esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
        HTTPClient cmdPoll;
        beginApiRequest(cmdPoll, String(API_BASE_URL) + "/dashboard-api/pending-command?external_id=" + chipId());
        cmdPoll.setTimeout(3000);
        addDeviceAuth(cmdPoll);
        int cmdCode = cmdPoll.GET();
        String cmdResp = cmdPoll.getString();
        cmdPoll.end();
        esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
        yield();
        Serial.printf("[F33] Poll → HTTP %d %s\n", cmdCode, cmdResp.c_str());

        if (cmdCode == 200) {
          // Simple JSON parse to find command_id and command type
          // (no ArduinoJSON — string search is lightweight enough for this)
          int cmdIdStart = cmdResp.indexOf("\"id\":");
          // El nombre del comando viene en el campo de nivel superior
          // "command_name":"..." (único, no anidado) que la API siempre
          // incluye junto al comando. Buscar "command": rompe porque también
          // aparece dentro del objeto anidado "command":{...,"command":...}.
          int cmdNameStart = cmdResp.indexOf("\"command_name\":");
          if (cmdIdStart >= 0 && cmdNameStart >= 0) {
            // Extract command id
            int cmdIdValStart = cmdResp.indexOf(":", cmdIdStart) + 1;
            int cmdIdEnd = cmdResp.indexOf(",", cmdIdValStart);
            if (cmdIdEnd < 0) cmdIdEnd = cmdResp.indexOf("}", cmdIdValStart);
            String cmdIdStr = cmdResp.substring(cmdIdValStart, cmdIdEnd);
            cmdIdStr.trim();
            int cmdId = cmdIdStr.toInt();

            // Extract command name from the top-level "command_name":"..." field
            // "command_name": = 15 chars + comilla de apertura = valor en +16
            int cmdValStart = cmdNameStart + 16;                 // saltar "command_name":"
            int cmdValEnd = cmdResp.indexOf("\"", cmdValStart);  // comilla de cierre
            String cmdName = (cmdValEnd > cmdValStart) ? cmdResp.substring(cmdValStart, cmdValEnd) : String("");

            Serial.printf("[F33] Executing command #%d: %s\n", cmdId, cmdName.c_str());

            if (cmdName == "check") {
              // Verify SCANNER: USB HID keyboard connected?
              bool scannerOk = scannerConnected;

              // Verify LOCK: 5ms relay pulse test
              bool lockOk = checkLock();

              // RPI is always online if we're executing this
              Serial.printf("[F33] SCANNER=%s LOCK=%s RPI=true\n",
                            scannerOk ? "ok" : "offline", lockOk ? "ok" : "offline");

